{
    "Experience": [
        {
            "company": "Bharat Electronics Ltd.",
            "role": "Software Developer Intern",
            "duration": "Aug - Sept 2023",
            "description": "Developed an NMS Topology System, a robust tool designed for creating a variety of topology diagrams to meet diverse network management needs. The system features a user-friendly interface for designing and customizing diagrams. My responsibilities included developing an intuitive UI for diagram customization, building reusable components, managing state changes, and optimizing the UI to ensure both performance and scalability.",
            "technology": [
                "React JS",
                "Tailwind CSS",
                "MUI Components",
                "MongoDB"
            ],
            "link":"https://bel-india.in/"
        },
        {
            "company": "PHN Technologies",
            "role": "Web Developer Intern",
            "duration": "April - June 2023",
            "description": "Developed an online shopping app website that utilizes various client-side tools to provide a seamless and engaging user experience. The website features a responsive design, intuitive navigation, and robust search functionality, allowing users to easily find and purchase products. My responsibilities included implementing robust search functionality and filtering options, ensuring seamless navigation and checkout processes, and implementing security measures to protect user data.",
            "technology": [
                "React JS",
                "Tailwind CSS",
                "Node.js",
                "REST API",
                "Payment Gateway API"
            ],
            "link":"https://phntechnology.com/"
        }
    ],
    "ProjectsDisplay": [
        {
            "name": "File Sharing Website(P2P)",
            "image": "",
            "description": "Developed an application that leverages advanced web technologies to provide a user-friendly and efficient platform for transferring files without the need for external servers. The system includes real-time device discovery and peer-to-peer (P2P) connections for a smooth sharing experience. My responsibilities included developing a responsive web interface for real-time device discovery and file sharing, implementing secure P2P connections using WebRTC for direct file transfers, and creating a robust backend system to manage device connections and data transfer protocols.",
            "techStack": [
                "React.js", "Node.js", "Web Sockets", "Docker", "WebRTC"
            ],
            "link": "https://github.com/FaizanKhan06/File-Sharing-Application-P2P"
        },
        {
            "name": "Fire Detection and Precision Sprinkler System",
            "image": "",
            "description": "The Real-Time Fire Detection and Precision Sprinkler System is a cutting-edge solution that utilizes advanced technologies to detect fires and extinguish them effectively. The system comprises sensors, cameras, and sprinklers that work in tandem to identify potential fire hazards, alert authorities, and deploy targeted water spray patterns to suppress fires. My responsibilities included developing an algorithm for real-time fire detection using computer vision, implementing a precision control system for targeted sprinkler activation, and creating an alert system for notifying authorities and building occupants.",
            "technology": [
                "Python",
                "Flask",
                "OpenCV",
                "Raspi OS",
                "HuggingFace API Integration"
            ],
            "link": "https://github.com/FaizanKhan06/Fire-Detection-and-Precision-Sprinkler-System"
        }
    ],
    "ProjectsArchive": [
        {
            "name": "Weather App",
            "description": "A simple weather application that fetches data from a public API and displays the current weather for any location.",
            "techStack": [
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "link": "https://faizan-weatherapp.com"
        },
        {
            "name": "Task Manager",
            "description": "A task management tool to organize and prioritize tasks with features like drag-and-drop and due date reminders.",
            "techStack": [
                "Vue.js",
                "Firebase"
            ],
            "link": "https://faizan-taskmanager.com"
        }
    ],
    "Skills": [
        {
            "name": "Programming Languages",
            "details": [
                "JavaScript",
                "Python",
                "Java"
            ]
        },
        {
            "name": "Web Development",
            "details": [
                "React",
                "Node.js",
                "Express",
                "HTML",
                "CSS"
            ]
        },
        {
            "name": "Tools & Platforms",
            "details": [
                "Git",
                "Docker",
                "AWS",
                "Jenkins"
            ]
        }
    ]
}
